import java.util.Scanner;

public class Main {
	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		int N = sc.nextInt();
		int[]dp = new int[N+2]; //@@@@ N+1했다가 N이 1일때 dp[2]가 index범위 초과해서 틀림
		dp[1]=1;
		dp[2]=2;
		for(int i=3;i<=N;i++) {
			if(i%2==0) {
				dp[i]=(dp[i-1]+dp[i/2])%1000000000; //짝수면 그전꺼 + i/2 
			}else {
				dp[i]=dp[i-1]; //홀수면 그전꺼랑 동일
			}
		}
		System.out.println(dp[N]);
	}
}


/*
 * 
 *N
                        *붙은건 new 
1     1   1
2     2   11                 2*
3     2   111               12
4     4   1111             112       22*      4*
5     4   11111           1112      122      14      ------------------------------------------------   
6     6   111111         11112     1122     114     222*    24*                                     |                       
7     6   1111111       111112    11122    1114    1222    124                                      |  x2                       
8    10   11111111     1111112   111122   11114   11222   1124   2222*   224*   44*  8*             | 
9    10   111111111   11111112  1111122  111114  111222  11124  12222   1224   144  18              V
10   14   1111111111 111111112 11111122 1111114 1111222 111124 112222  11224  1144 118   22222* 2224*  244*   28*   
 * 
 *
 */
