class Solution {
    public int solution(int n) {
        int answer = 0;
       
        /*
        1   전체 감싼거 : ()    ->  dp[1] = 1 , dp2[1] = 1 
        2   전체 감싼거 : (())  그외 : ()()    -> dp[2] = 2 , dp2[1] = 1
        3   전체 감싼거 : ((()))  (()()) / 그 외 : ()(())  ()()() (())()  ->  dp[3]=5 , dp2[3] = 2
        4   전체 감싼거 : (((()))) ((()()))   ((())())  (()(()))  (()()()) 
         그 외 : ()((())) ()(()()) ()(())()  ()()(()) ()()()() , (())(()) (())()() , ((()))() (()())() 
          dp[4] = 14  ,  dp2[4] = 5
        */
        
        //모든 올바른 괄호 경우의 수 dp
        int[] dp = new int[n+1];
        //전체 감싸진 괄호 경우의 수 dp
        int[] dp2 = new int[n+1];

        dp[1]=1;
        dp2[1]=1;

        for(int i=2;i<=n;i++){
            dp2[i]=dp[i-1];
 
            int sum =0;
            for(int j=1;j<=i;j++){
                sum+=dp[j]*dp2[i-j];
            }
            dp[i]=dp2[i] + sum; //전체 감싼거, 그 외 경우의 수
 
        }
        answer = dp[n];
        return answer;
    }
}
