function solution(n) {
    var answer = 0;
    
    /*
    x // 15 - 0 = 15 // 15
    0(+15) = 15
    x + x // 15 - 1+2 = 12 // 12/2=6
    1(+6) + 2(+6) = 15
    x + x + x // 15 - 1+2+3 = 9 // 9/3=3
    1(+3) + 2(+3) + 3(+3) = 15
    x + x + x // 15 - 1+2+3+4 = 5 // 5/4
    x + x + x + x // 15 - 1+2+3+4+5 = 0 0/5=0
    1 + 2 + 3 + 4 + 5 =15
    */
    
    let cnt=0
    n -= cnt;
    while(n > 0) {
        cnt++;
        n -= cnt;
        if(n%cnt == 0) {
            answer++;
            console.log(cnt)
        }
    }
    console.log('답',answer);
    
    /*
    1: 1 => 1가지
    2: 2 => 1가지
    3: 3, 1+2 => 2가지
    4: 4 => 1가지
    5: 5, 2+3 => 2가지
    6: 6, 1+2+3 => 2가지
    7: 7, 3+4 => 2가지
    8: 8 => 1가지 ??
    9: 9, 2+3+4, 4+5 => 3가지
    10: 10, 1+2+3+4 => 2가지
    11: 11, 5+6 => 2가지
    12: 12, 3+4+5 => 2가지
    13: 13, 6+7 => 2가지
    약수가 홀수인것 개수일까
    */
    
    // for(let i = 1; i <= n; i++){
    //     if((n%i) === 0 && (i%2) === 1) answer++;
    // }
    
    return answer;
}
