class Solution {
    //각 번호에서 다음 번호를 누를때 드는 가중치 배열로 저장
    static int[][] weight={
        {1,7,6,7,5,4,5,3,2,3},//0
        {7,1,2,4,2,3,5,4,5,6},//1
        {6,2,1,2,3,2,3,5,4,5},//2
        {7,4,2,1,5,3,2,6,5,4},//3
        {5,2,3,5,1,2,4,2,3,5},//4
        {4,3,2,3,2,1,2,3,2,3},//5
        {5,5,3,2,4,2,1,5,3,2},//6
        {3,4,5,6,2,3,5,1,2,4},//7
        {2,5,4,5,3,2,3,2,1,2},//8
        {3,6,5,4,5,3,2,4,2,1}//9
    };
    public int solution(String numbers) {
        int answer = 0;
        
        //dp로 왼쪽 손 이동, 오른쪽 손 이동시 가중치를 각각 저장해서
        //dp[인덱스][왼손이동][오른손이동] .. 
        
        
        return answer;
    }
}
